Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
    // ----- duration 3
    asm("labe_apply_pwr_level__d3_c1:");
        asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        AUX_DELAY_1
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("return");

    // ----- duration 2+3
    asm("labe_apply_pwr_level__d2c1__d3c1:");
        asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        AUX_DELAY_7 // distribute load more evenly
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        AUX_DELAY_1
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("return");

    // ----- duration 3+3
    asm("labe_apply_pwr_level__d3c1__d3c1:");
        asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        AUX_DELAY_1
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        AUX_DELAY_7 // distribute load more evenly
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        AUX_DELAY_1
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("return");

    asm("labe_apply_pwr_level__d3_c2:");
    asm("movlw 1");
    asm("goto labe_apply_pwr_level__d3_cycle_preinit");

    asm("labe_apply_pwr_level__d3_c3:");
    asm("movlw 2");
    asm("goto labe_apply_pwr_level__d3_cycle_preinit");

    asm("labe_apply_pwr_level__d3_c4:");
    asm("movlw 3");
    asm("goto labe_apply_pwr_level__d3_cycle_preinit");

    asm("labe_apply_pwr_level__d3_c5:");
    asm("movlw 4");
    asm("goto labe_apply_pwr_level__d3_cycle_preinit");

    asm("labe_apply_pwr_level__d3_c7:");
    asm("movlw 6");
    asm("goto labe_apply_pwr_level__d3_cycle_preinit");

    asm("labe_apply_pwr_level__d3_c9:");
    asm("movlw 8");
    asm("goto labe_apply_pwr_level__d3_cycle_preinit");

    asm("labe_apply_pwr_level__d3_c12:");
    asm("movlw 11");
    asm("goto labe_apply_pwr_level__d3_cycle_preinit");

    asm("labe_apply_pwr_level__d3_c15:");
    asm("movlw 14");
    asm("goto labe_apply_pwr_level__d3_cycle_preinit");

    asm("labe_apply_pwr_level__d3_c19:");
    asm("movlw 18");
    asm("goto labe_apply_pwr_level__d3_cycle_preinit");

    asm("labe_apply_pwr_level__d3_c24:");
    asm("movlw 23");
    asm("goto labe_apply_pwr_level__d3_cycle_preinit");

    // ----- generic 3
    asm("labe_apply_pwr_level__d3_cycle_preinit:");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    asm("labe_apply_pwr_level__d3_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_1
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d3_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_1
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

    asm("labe_apply_pwr_level__d4_c18:");
    asm("movlw 17");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    // ----- generic 4
    asm("labe_apply_pwr_level__d4_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_2
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d4_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_2
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

    asm("labe_apply_pwr_level__d5_c15:");
    asm("movlw 14");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    // ----- generic 5
    asm("labe_apply_pwr_level__d5_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_3
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d5_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_3
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

