Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
    asm("labe_apply_pwr_level__d6_c12:");
    asm("movlw 11");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    // ----- generic 6
    asm("labe_apply_pwr_level__d6_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_4
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            AUX_DELAY_1
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d6_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_4
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

    asm("labe_apply_pwr_level__d7_c10:");
    asm("movlw 9");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    // ----- generic 7
    asm("labe_apply_pwr_level__d7_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_5
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            AUX_DELAY_2
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d7_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_5
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

    asm("labe_apply_pwr_level__d9_c8:");
    asm("movlw 7");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    // ----- generic 9
    asm("labe_apply_pwr_level__d9_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_7
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            AUX_DELAY_4
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d9_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_7
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

    asm("labe_apply_pwr_level__d12_c6:");
    asm("movlw 5");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    // ----- generic 12
    asm("labe_apply_pwr_level__d12_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_10
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            AUX_DELAY_7
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d12_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_10
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

    asm("labe_apply_pwr_level__d15_c5:");
    asm("movlw 4");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    // ----- generic 15
    asm("labe_apply_pwr_level__d15_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_13
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            AUX_DELAY_10
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d15_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_13
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

    asm("labe_apply_pwr_level__d18_c4:");
    asm("movlw 3");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    // ----- generic 18
    asm("labe_apply_pwr_level__d18_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_16
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            AUX_DELAY_13
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d18_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_16
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");


